1C_StockControl_NewMethod/src/Documents/ПродажаТовара/ПродажаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТовара</name>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>InformationRegister.ИсторияЦенПродажи</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1C_StockControl_NewMethod/src/Documents/ПродажаТовара/ObjectModule.bsl
// Используем следующий метод:
// списываем необходимые товары, далее проверяем — образовались ли отрицательные остатки.
// Если да, то нужно откатить проведение документа.
// Используем этот метод, потому что он аботает быстрее и 
// по условиям задачи нам  нужно делать все равно никаких запросов 
// предварительно, всей информации достаточно в док-те

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

// Проверки

Для Каждого Стр из Товары Цикл
	
	Если Стр.Цена = 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена цена по товару " + Стр.НаименованиеТовара;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецЦикла;

Если Отказ Тогда
	Возврат
КонецЕсли;

#Область ВременнаяТаблица

// Менеджер временных таблиц

МенеджерВТ = Новый МенеджерВременныхТаблиц;

 
// Получаем сгруппированный данные в ВТ (Товар +Срок годности)

Запрос = Новый Запрос;
Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

Запрос.Текст =
"ВЫБРАТЬ
|	ПродажаТовараТовары.НаименованиеТовара КАК НаименованиеТовара,
|	ПродажаТовараТовары.СрокГодности КАК СрокГодности,
|	СУММА(ПродажаТовараТовары.Количество) КАК Количество,
|	ПродажаТовараТовары.Цена КАК Цена
|ПОМЕСТИТЬ ТоварыДок
|ИЗ
|	Документ.ПродажаТовара.Товары КАК ПродажаТовараТовары
|ГДЕ
|	ПродажаТовараТовары.Ссылка = &Ссылка
|
|СГРУППИРОВАТЬ ПО
|	ПродажаТовараТовары.НаименованиеТовара,
|	ПродажаТовараТовары.СрокГодности,
|	ПродажаТовараТовары.Цена
|
|ИНДЕКСИРОВАТЬ ПО
|	НаименованиеТовара,
|	СрокГодности
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ТоварыДок.НаименованиеТовара КАК Товар, 
|	ТоварыДок.СрокГодности КАК СрокГодности,
|	ТоварыДок.Количество КАК Количество
|ИЗ
|	ТоварыДок КАК ТоварыДок";

Запрос.УстановитьПараметр("Ссылка", Ссылка);
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать ();

#КонецОбласти

#Область ДвиженияСвободныеОстатки 

// Формируем блокировку данных
Блокировка = Новый БлокировкаДанных;
ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СвободныеОстатки");

ЭлементБлокировки.ИсточникДанных = Товары; 
ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "НаименованиеТовара");
ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СрокГодности", "СрокГодности");

// Устанавливаем исключительный режим (чтобы никто не мог даже прочитать эти остатки)
ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

Блокировка.Заблокировать();

Движения.СвободныеОстатки.Очистить(); //очищаем, если док-т ранее проводился

// Формируем движения по регсистру СвободныеОстатки (расход)

Пока Выборка.Следующий() Цикл
	
	Движение = Движения.СвободныеОстатки.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	
	Движение.Товар = Выборка.Товар;
	Движение.СрокГодности = Выборка.СрокГодности;
	Движение.Количество = Выборка.Количество;
	
КонецЦикла;

Движения.СвободныеОстатки.Записывать = Истина;
Движения.СвободныеОстатки.Записать(); // Записываем физически в БД, чтобы запрос во 2-м блоке увидел эти цифры

#КонецОбласти

#Область ПроверкаОстатки
//4. Проверяем отрицательные остатки после движения 

ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);

Запрос2 = Новый Запрос;
Запрос2.МенеджерВременныхТаблиц =МенеджерВТ;

Запрос2.Текст =
"ВЫБРАТЬ
|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Остатки.Товар) КАК ТоварПредставление,
|	Остатки.Товар КАК НаименованиеТовара,
|	Остатки.СрокГодности КАК СрокГодности,
|	-Остатки.КоличествоОстаток КАК Дефицит
|ИЗ
|	РегистрНакопления.СвободныеОстатки.Остатки(&Момент, ) КАК Остатки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыДок КАК ТоварыДок
|		ПО Остатки.Товар = ТоварыДок.НаименованиеТовара
|			И Остатки.СрокГодности = ТоварыДок.СрокГодности
|ГДЕ
|	Остатки.КоличествоОстаток < 0";

Запрос2.УстановитьПараметр("Момент", ГраницаКонтроля);

РезОтриц = Запрос2.Выполнить();

Если НЕ РезОтриц.Пустой()Тогда
	Отказ = Истина;
	
	ВыборкаОшибки = РезОтриц.Выбрать();
	Пока ВыборкаОшибки.Следующий()Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =
		"Недостаточно товара " + ВыборкаОшибки.ТоварПредставление
		+ "(срок годности " + Формат (ВыборкаОшибки.СрокГодности,"ДФ=dd.MM.yyyy") + ")" 
		+ " в количестве " + Формат(ВыборкаОшибки.Дефицит, "ЧГ=15.3");
		Сообщение.Сообщить();
	КонецЦикла;
	
	Возврат;
	
КонецЕсли;

#КонецОбласти

#Область ЦеныРегистрЦен

// 5. Если остатки ок — пишем историю цен (период = ТекущаяДата())

Движения.ИсторияЦенПродажи.Очистить(); 

ЗапросЦены = Новый Запрос;
ЗапросЦены.МенеджерВременныхТаблиц = МенеджерВТ;

ЗапросЦены.Текст =
"ВЫБРАТЬ
|	ТоварыДок.НаименованиеТовара КАК Товар,
|	МАКСИМУМ(ТоварыДок.Цена) КАК ЦенаДок,
|	ЕСТЬNULL(Цены.Цена, 0) КАК ЦенаПоследняя
|ИЗ
|	ТоварыДок КАК ТоварыДок
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияЦенПродажи.СрезПоследних(&Момент, ) КАК Цены
|		ПО ТоварыДок.НаименованиеТовара = Цены.Товар
|
|СГРУППИРОВАТЬ ПО
|	ТоварыДок.НаименованиеТовара,
|	ЕСТЬNULL(Цены.Цена, 0)";

ЗапросЦены.УстановитьПараметр("Момент", ТекущаяДата()); 

ВыборкаЦен = ЗапросЦены.Выполнить().Выбрать();
Пока ВыборкаЦен.Следующий() Цикл

    // пишем, если цены не было (0) или изменилась
    Если ВыборкаЦен.ЦенаПоследняя = 0 Или ВыборкаЦен.ЦенаПоследняя <> ВыборкаЦен.ЦенаДок Тогда
        ЗапЦены = Движения.ИсторияЦенПродажи.Добавить();
        ЗапЦены.Период = ТекущаяДата(); 
		ЗапЦены.Товар  = ВыборкаЦен.Товар;
        ЗапЦены.Цена   = ВыборкаЦен.ЦенаДок;
    КонецЕсли;

КонецЦикла;

Движения.ИсторияЦенПродажи.Записывать = Истина;
Движения.Записать();

#КонецОбласти

КонецПроцедуры
